server/app/controllers/homepage_controller.rb

    def index
        token = params[:jwt]
        hmac_secret = '$ecr#tK@Y&'
        decoded_token = JWT.decode token, hmac_secret, true, { algorithm: 'HS256'}

        user_content = User.find_by(username: decoded_token[0]["user_name"])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "lauren"], ["LIMIT", 1]]

    def delete
        content = Content.find(params[:content_id])
        content.delete
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "contents" WHERE "contents"."id" = $1  [["id", 15]]

    def add
        token = params[:jwt]
        hmac_secret = '$ecr#tK@Y&'
        decoded_token = JWT.decode token, hmac_secret, true, { algorithm: 'HS256'}

        user = User.find_by(username: decoded_token[0]["user_name"])
        content = Content.create(description: params[:description], url: params[:url], image: params[:image], category: params[:category], user_id: user.id)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mike"], ["LIMIT", 1]]
INSERT INTO "contents" ("category", "url", "image", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"