server/app/controllers/users_controller.rb

    def register
        user = User.create(username: params[:username], password: params[:password])
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

    def login
        user = User.find_by(:username => params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "mike"], ["LIMIT", 1]]